emacs/doom/config.org
:doc-config:
# Tangle by default to config.el, which is the most common case
#+property: header-args:emacs-lisp :tangle config.el
#+property: header-args :mkdirp yes :comments both
#+startup: fold

# Use the ReadTheOrg theme for HTML export
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

#+options: num:nil
:end:

#+title: Doom Emacs Configuration

This is my configuration for Doom Emacs.

* Overview

A Doom Emacs configuration consists of at least three files:
- =init.el= - defines which of the existing Doom modules are loaded. A Doom module is a bundle of packages, configuration and commands, organized into a unit that can be toggled easily from this file.
- =packages.el= - defines which packages should be installed, beyond those that are installed and loaded as part of the enabled modules.
- =config.el= - contains all custom configuration and code.

All the config files are generated from this Org file, to try and make its meaning as clear as possible. All =package!= declarations are written to =packages.el=, all other LISP code is written to =config.el=.

