emacs/doom/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-20 Sun 22:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs Configuration</title>
<meta name="author" content="Ben Melton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Doom Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org57bd5e8">Overview</a></li>
<li><a href="#org05e1ab5">File Headers</a></li>
<li><a href="#org94f6b66">Modules</a></li>
<li><a href="#org2ad7a79">Configuration</a>
<ul>
<li><a href="#orgf21ad20">User Information</a></li>
<li><a href="#org0cfe374">Mac Settings</a>
<ul>
<li><a href="#orgc293153">UI behavior</a></li>
<li><a href="#orgbcde564">Authentication source order</a></li>
<li><a href="#org9976e39">Capturing links to external applications</a></li>
</ul>
</li>
<li><a href="#org7d3998e">Doom/Emacs</a>
<ul>
<li><a href="#orga9dea7f">Fonts</a></li>
<li><a href="#org54cb166">Themes</a></li>
<li><a href="#org2337d74">Appearance</a></li>
<li><a href="#orge0d75c8">Key Bindings</a></li>
<li><a href="#orgfeb81d6">Auto Save &amp; Backup Files</a></li>
</ul>
</li>
<li><a href="#org1ae66b7">Org-Mode</a>
<ul>
<li><a href="#orgbbb55cd">Appearance</a></li>
<li><a href="#org4652c1a">Org-Appear</a></li>
<li><a href="#orgd0d6e18">Org-Auto-Tangle</a></li>
<li><a href="#orgfafb038">Org-Roam</a></li>
<li><a href="#org23c5757">Org-Roam-UI</a></li>
</ul>
</li>
<li><a href="#org06a853b">(System)Verilog</a>
<ul>
<li><a href="#orga95b15b">Verilog-Mode</a></li>
<li><a href="#org196366b">Verilog-Ts-Mode</a></li>
<li><a href="#org2ade045">Verilog-Ext</a></li>
<li><a href="#orgca274a2">Appearance</a></li>
<li><a href="#org6fae1d8">Behavior</a></li>
<li><a href="#orga31a084">Completion</a></li>
<li><a href="#org5f3ecab">Hierarchy</a></li>
<li><a href="#org435bc64">Templates</a></li>
<li><a href="#org57673c0">Linting</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<p>
This is my configuration for Doom Emacs.
</p>
<div id="outline-container-org57bd5e8" class="outline-2">
<h2 id="org57bd5e8">Overview</h2>
<div class="outline-text-2" id="text-org57bd5e8">
<p>
A Doom Emacs configuration consists of at least three files:
</p>
<ul class="org-ul">
<li><code>init.el</code> - defines which of the existing Doom modules are loaded. A Doom module is a bundle of packages, configuration and commands, organized into a unit that can be toggled easily from this file.</li>
<li><code>packages.el</code> - defines which packages should be installed, beyond those that are installed and loaded as part of the enabled modules.</li>
<li><code>config.el</code> - contains all custom configuration and code.</li>
</ul>

<p>
All the config files are generated from this Org file, to try and make its meaning as clear as possible. All <code>package!</code> declarations are written to <code>packages.el</code>, all other LISP code is written to <code>config.el</code>.
</p>
</div>
</div>
