emacs/doom/config.html
<div id="outline-container-org05e1ab5" class="outline-2">
<h2 id="org05e1ab5">File Headers</h2>
<div class="outline-text-2" id="text-org05e1ab5">
<p>
The following snippets contain the headers for each file, originally generated by the <code>doom install</code> command. They contain some important <code>elisp</code> indicators and notes.
</p>
<details><summary>init.el</summary>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;;; </span><span style="color: #405A61;">init.el -*- lexical-binding: t; -*-</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">DO NOT EDIT THIS FILE DIRECTLY</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">This is a file generated from a literate programing source file, config.org</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">You should make any changes there and regenerate it from Emacs org-mode</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">using org-babel-tangle (C-c C-v t)</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">This file controls what Doom modules are enabled and what order they load</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">in. Remember to run 'doom sync' after modifying it!</span>

<span style="color: #405A61;">;; </span><span style="color: #859900; font-weight: bold;">NOTE</span><span style="color: #405A61;"> Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">documentation. There you'll find a link to Doom's Module Index where all</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">of our modules are listed, including what flags they support.</span>

<span style="color: #405A61;">;; </span><span style="color: #859900; font-weight: bold;">NOTE</span><span style="color: #405A61;"> Move your cursor over a module's name (or its flags) and press '</span><span style="color: #d33682; font-weight: bold;">K</span><span style="color: #405A61;">' (or</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">'C-c c k' for non-vim users) to view its documentation. This works on</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">flags as well (those symbols that start with a plus).</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">Alternatively, press '</span><span style="color: #d33682; font-weight: bold;">gd</span><span style="color: #405A61;">' (or 'C-c c d') on a module to browse its</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">directory (for easy access to its source code).</span>
</pre>
</div>
</details>
<details><summary>packages.el</summary>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;; </span><span style="color: #405A61;">-*- no-byte-compile: t; -*-</span>
<span style="color: #405A61;">;;; </span><span style="color: #405A61;">$DOOMDIR/packages.el</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">DO NOT EDIT THIS FILE DIRECTLY</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">This is a file generated from a literate programing source file, config.org</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">You should make any changes there and regenerate it from Emacs org-mode</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">using org-babel-tangle (C-c C-v t)</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">To install a package with Doom you must declare them here and run 'doom sync'</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">on the command line, then restart Emacs for the changes to take effect -- or</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">use 'M-x doom/reload'.</span>


<span style="color: #405A61;">;; </span><span style="color: #405A61;">To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! some-package)</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">To install a package directly from a remote git repo, you must specify a</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">`</span><span style="color: #d33682; font-weight: bold;">:recipe</span><span style="color: #405A61;">'. You'll find documentation on what `</span><span style="color: #d33682; font-weight: bold;">:recipe</span><span style="color: #405A61;">' accepts here:</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">https://github.com/radian-software/straight.el#the-recipe-format</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! another-package</span>
<span style="color: #405A61;">;  </span><span style="color: #405A61;">:recipe (:host github :repo "username/repo"))</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">If the package you are trying to install does not contain a PACKAGENAME.el</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">file, or is located in a subdirectory of the repo, you'll need to specify</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">`</span><span style="color: #d33682; font-weight: bold;">:files</span><span style="color: #405A61;">' in the `</span><span style="color: #d33682; font-weight: bold;">:recipe</span><span style="color: #405A61;">':</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! this-package</span>
<span style="color: #405A61;">;  </span><span style="color: #405A61;">:recipe (:host github :repo "username/repo"</span>
<span style="color: #405A61;">;           </span><span style="color: #405A61;">:files ("some-file.el" "src/lisp/*.el")))</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">If you'd like to disable a package included with Doom, you can do so here</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">with the `</span><span style="color: #d33682; font-weight: bold;">:disable</span><span style="color: #405A61;">' property:</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! builtin-package :disable t)</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">You can override the recipe of a built in package without having to specify</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">all the properties for `</span><span style="color: #d33682; font-weight: bold;">:recipe</span><span style="color: #405A61;">'. These will inherit the rest of its recipe</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">from Doom or MELPA/ELPA/Emacsmirror:</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! builtin-package :recipe (:nonrecursive t))</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! builtin-package-2 :recipe (:repo "myfork/package"))</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">Specify a `</span><span style="color: #d33682; font-weight: bold;">:branch</span><span style="color: #405A61;">' to install a package from a particular branch or tag.</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">This is required for some packages whose default branch isn't '</span><span style="color: #d33682; font-weight: bold;">master</span><span style="color: #405A61;">' (which</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">our package manager can't deal with; see radian-software/straight.el#279)</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! builtin-package :recipe (:branch "develop"))</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">Use `</span><span style="color: #d33682; font-weight: bold;">:pin</span><span style="color: #405A61;">' to specify a particular commit to install.</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(package! builtin-package :pin "1a2b3c4d5e")</span>


<span style="color: #405A61;">;; </span><span style="color: #405A61;">Doom's packages are pinned to a specific commit and updated from release to</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">release. The `</span><span style="color: #d33682; font-weight: bold;">unpin!</span><span style="color: #405A61;">' macro allows you to unpin single packages...</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(unpin! pinned-package)</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">...or multiple packages</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(unpin! pinned-package another-pinned-package)</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">...Or *all* packages (NOT RECOMMENDED; will likely break things)</span>
<span style="color: #405A61;">;</span><span style="color: #405A61;">(unpin! t)</span>
</pre>
</div>
</details>
<details><summary>config.el</summary>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;;; </span><span style="color: #405A61;">$DOOMDIR/config.el -*- lexical-binding: t; -*-</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">DO NOT EDIT THIS FILE DIRECTLY</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">This is a file generated from a literate programing source file, config.org</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">You should make any changes there and regenerate it from Emacs org-mode</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">using org-babel-tangle (C-c C-v t)</span>

<span style="color: #405A61;">;; </span><span style="color: #405A61;">Place your private configuration here! Remember, you do not need to run 'doom</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">sync' after modifying this file!</span>


<span style="color: #405A61;">;; </span><span style="color: #405A61;">Whenever you reconfigure a package, make sure to wrap your config in an</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">`</span><span style="color: #d33682; font-weight: bold;">after!</span><span style="color: #405A61;">' block, otherwise Doom's defaults may override your settings. E.g.</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">(after! PACKAGE</span>
<span style="color: #405A61;">;;     </span><span style="color: #405A61;">(setq x y))</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">The exceptions to this rule:</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">- Setting file/directory variables (like `</span><span style="color: #d33682; font-weight: bold;">org-directory</span><span style="color: #405A61;">')</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">- Setting variables which explicitly tell you to set them before their</span>
<span style="color: #405A61;">;;     </span><span style="color: #405A61;">package is loaded (see 'C-h v VARIABLE' to look up their documentation).</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">- Setting doom variables (which start with '</span><span style="color: #d33682; font-weight: bold;">doom-</span><span style="color: #405A61;">' or '</span><span style="color: #d33682; font-weight: bold;">+</span><span style="color: #405A61;">').</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">Here are some additional functions/macros that will help you configure Doom.</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">load!</span><span style="color: #405A61;">' for loading external *.el files relative to this one</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">use-package!</span><span style="color: #405A61;">' for configuring packages</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">after!</span><span style="color: #405A61;">' for running code after a package has loaded</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">add-load-path!</span><span style="color: #405A61;">' for adding directories to the `</span><span style="color: #d33682; font-weight: bold;">load-path</span><span style="color: #405A61;">', relative to</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">this file. Emacs searches the `</span><span style="color: #d33682; font-weight: bold;">load-path</span><span style="color: #405A61;">' when you load packages with</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">`</span><span style="color: #d33682; font-weight: bold;">require</span><span style="color: #405A61;">' or `</span><span style="color: #d33682; font-weight: bold;">use-package</span><span style="color: #405A61;">'.</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">map!</span><span style="color: #405A61;">' for binding new keys</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">To get information about any of these functions/macros, move the cursor over</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">the highlighted symbol at press '</span><span style="color: #d33682; font-weight: bold;">K</span><span style="color: #405A61;">' (non-evil users must press 'C-c c k').</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">This will open documentation for it, including demos of how they are used.</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">etc).</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">You can also try '</span><span style="color: #d33682; font-weight: bold;">gd</span><span style="color: #405A61;">' (or 'C-c c d') to jump to their definition and see how</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">they are implemented.</span>
</pre>
</div>
</details>
<br>
</div>
</div>
