emacs/doom/config.html
<div id="outline-container-org94f6b66" class="outline-2">
<h2 id="org94f6b66">Modules</h2>
<div class="outline-text-2" id="text-org94f6b66">
<p>
The following code is part of the <code>init.el</code> file. It identifies the Doom modules that should be loaded at startup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">doom!</span> <span style="color: #268bd2;">:input</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">bidi              ; (tfel ot) thgir etirw uoy gnipleh</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">chinese</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">japanese</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">layout            ; auie,ctsrnm is the superior home row</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:completion</span>
&#9474;      company           <span style="color: #405A61;">; </span><span style="color: #405A61;">the ultimate code completion backend</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">helm              ; the *other* search engine for love and life</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ido               ; the other *other* search engine...</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ivy               ; a search engine for love and life</span>
&#9474;      vertico           <span style="color: #405A61;">; </span><span style="color: #405A61;">the search engine of the future</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:ui</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">deft              ; notational velocity for Emacs</span>
&#9474;      doom              <span style="color: #405A61;">; </span><span style="color: #405A61;">what makes DOOM look the way it does</span>
&#9474;      doom-dashboard    <span style="color: #405A61;">; </span><span style="color: #405A61;">a nifty splash screen for Emacs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">doom-quit         ; DOOM quit-message prompts when you quit Emacs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(emoji +unicode)  ; &#128578;</span>
&#9474;      hl-todo           <span style="color: #405A61;">; </span><span style="color: #405A61;">highlight </span><span style="color: #b58900; font-weight: bold;">TODO</span><span style="color: #405A61;">/</span><span style="color: #dc322f; font-weight: bold;">FIXME</span><span style="color: #405A61;">/</span><span style="color: #859900; font-weight: bold;">NOTE</span><span style="color: #405A61;">/</span><span style="color: #35a69c; font-weight: bold;">DEPRECATED</span><span style="color: #405A61;">/</span><span style="color: #d33682; font-weight: bold;">HACK</span><span style="color: #405A61;">/</span><span style="color: #859900; font-weight: bold;">REVIEW</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">hydra</span>
&#9474;      indent-guides     <span style="color: #405A61;">; </span><span style="color: #405A61;">highlighted indent columns</span>
&#9474;      <span style="color: #d33682;">(</span>ligatures +extra<span style="color: #d33682;">)</span><span style="color: #405A61;">; </span><span style="color: #405A61;">ligatures and symbols to make your code pretty again</span>
&#9474;      minimap           <span style="color: #405A61;">; </span><span style="color: #405A61;">show a map of the code on the side</span>
&#9474;      modeline          <span style="color: #405A61;">; </span><span style="color: #405A61;">snazzy, Atom-inspired modeline, plus API</span>
&#9474;      nav-flash         <span style="color: #405A61;">; </span><span style="color: #405A61;">blink cursor line after big motions</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">neotree           ; a project drawer, like NERDTree for vim</span>
&#9474;      ophints           <span style="color: #405A61;">; </span><span style="color: #405A61;">highlight the region an operation acts on</span>
&#9474;      <span style="color: #d33682;">(</span>popup +defaults<span style="color: #d33682;">)</span>   <span style="color: #405A61;">; </span><span style="color: #405A61;">tame sudden yet inevitable temporary windows</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">tabs              ; a tab bar for Emacs</span>
&#9474;      treemacs          <span style="color: #405A61;">; </span><span style="color: #405A61;">a project drawer, like neotree but cooler</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">unicode           ; extended unicode support for various languages</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(vc-gutter +pretty) ; vcs diff in the fringe</span>
&#9474;      vi-tilde-fringe   <span style="color: #405A61;">; </span><span style="color: #405A61;">fringe tildes to mark beyond EOB</span>
&#9474;      window-select     <span style="color: #405A61;">; </span><span style="color: #405A61;">visually switch windows</span>
&#9474;      workspaces        <span style="color: #405A61;">; </span><span style="color: #405A61;">tab emulation, persistence &amp; separate workspaces</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">zen               ; distraction-free coding or writing</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:editor</span>
&#9474;      <span style="color: #d33682;">(</span>evil +everywhere<span style="color: #d33682;">)</span><span style="color: #405A61;">; </span><span style="color: #405A61;">come to the dark side, we have cookies</span>
&#9474;      file-templates    <span style="color: #405A61;">; </span><span style="color: #405A61;">auto-snippets for empty files</span>
&#9474;      fold              <span style="color: #405A61;">; </span><span style="color: #405A61;">(nigh) universal code folding</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(format +onsave)  ; automated prettiness</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">god               ; run Emacs commands without modifier keys</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">lispy             ; vim for lisp, for people who don't like vim</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">multiple-cursors  ; editing in many places at once</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">objed             ; text object editing for the innocent</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">parinfer          ; turn lisp into python, sort of</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">rotate-text       ; cycle region at point between text candidates</span>
&#9474;      snippets          <span style="color: #405A61;">; </span><span style="color: #405A61;">my elves. They type so I don't have to</span>
&#9474;      <span style="color: #6c71c4;">word-wrap</span>         <span style="color: #405A61;">; </span><span style="color: #405A61;">soft wrapping with language-aware indent</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:emacs</span>
&#9474;      dired             <span style="color: #405A61;">; </span><span style="color: #405A61;">making dired pretty [functional]</span>
&#9474;      electric          <span style="color: #405A61;">; </span><span style="color: #405A61;">smarter, keyword-based electric-indent</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ibuffer         ; interactive buffer management</span>
&#9474;      undo              <span style="color: #405A61;">; </span><span style="color: #405A61;">persistent, smarter undo for your inevitable mistakes</span>
&#9474;      vc                <span style="color: #405A61;">; </span><span style="color: #405A61;">version-control and Emacs, sitting in a tree</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:term</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">eshell            ; the elisp shell that works everywhere</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">shell             ; simple shell REPL for Emacs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">term              ; basic terminal emulator for Emacs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">vterm             ; the best terminal emulation in Emacs</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:checkers</span>
&#9474;      syntax              <span style="color: #405A61;">; </span><span style="color: #405A61;">tasing you for every semicolon you forget</span>
&#9474;      <span style="color: #d33682;">(</span>spell +flyspell<span style="color: #d33682;">)</span> <span style="color: #405A61;">; </span><span style="color: #405A61;">tasing you for misspelling mispelling</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">grammar           ; tasing grammar mistake every you make</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:tools</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ansible</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">biblio            ; Writes a PhD for you (citation needed)</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">collab            ; buffers with friends</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">debugger          ; </span><span style="color: #dc322f; font-weight: bold;">FIXME</span><span style="color: #405A61;"> stepping through code, to help you add bugs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">direnv</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">docker</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">editorconfig      ; let someone else argue about tabs vs spaces</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ein               ; tame Jupyter notebooks with emacs</span>
&#9474;      <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">eval</span> +overlay<span style="color: #d33682;">)</span>     <span style="color: #405A61;">; </span><span style="color: #405A61;">run code, run (also, repls)</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">gist              ; interacting with github gists</span>
&#9474;      lookup              <span style="color: #405A61;">; </span><span style="color: #405A61;">navigate your code and its documentation</span>
&#9474;      lsp               <span style="color: #405A61;">; </span><span style="color: #405A61;">M-x vscode</span>
&#9474;      magit             <span style="color: #405A61;">; </span><span style="color: #405A61;">a git porcelain for Emacs</span>
&#9474;      make              <span style="color: #405A61;">; </span><span style="color: #405A61;">run make tasks from Emacs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">pass              ; password manager for nerds</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">pdf               ; pdf enhancements</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">prodigy           ; </span><span style="color: #dc322f; font-weight: bold;">FIXME</span><span style="color: #405A61;"> managing external services &amp; code builders</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">rgb               ; creating color strings</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">taskrunner        ; taskrunner for all your projects</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">terraform         ; infrastructure as code</span>
&#9474;      tmux              <span style="color: #405A61;">; </span><span style="color: #405A61;">an API for interacting with tmux</span>
&#9474;      tree-sitter       <span style="color: #405A61;">; </span><span style="color: #405A61;">syntax and parsing, sitting in a tree...</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">upload            ; map local to remote projects via ssh/ftp</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:os</span>
&#9474;      <span style="color: #d33682;">(</span><span style="color: #268bd2;">:if</span> <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">featurep</span> <span style="color: #d33682; font-weight: bold;">:system</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">macos</span><span style="color: #859900;">)</span> macos<span style="color: #d33682;">)</span>  <span style="color: #405A61;">; </span><span style="color: #405A61;">improve compatibility with macOS</span>
&#9474;      <span style="color: #d33682;">(</span>tty +osc<span style="color: #d33682;">)</span>          <span style="color: #405A61;">; </span><span style="color: #405A61;">improve the terminal Emacs experience</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:lang</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">agda              ; types of types of types of types...</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">beancount         ; mind the GAAP</span>
&#9474;      <span style="color: #d33682;">(</span>cc +lsp<span style="color: #d33682;">)</span>         <span style="color: #405A61;">; </span><span style="color: #405A61;">C &gt; C++ == 1</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">clojure           ; java with a lisp</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">common-lisp       ; if you've seen one lisp, you've seen them all</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">coq               ; proofs-as-programs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">crystal           ; ruby at the speed of c</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">csharp            ; unity, .NET, and mono shenanigans</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">data              ; config/data formats</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(dart +flutter)   ; paint ui and not much else</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">dhall</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">elixir            ; erlang done right</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">elm               ; care for a cup of TEA?</span>
&#9474;      emacs-lisp        <span style="color: #405A61;">; </span><span style="color: #405A61;">drown in parentheses</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">erlang            ; an elegant language for a more civilized age</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ess               ; emacs speaks statistics</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">factor</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">faust             ; dsp, but you get to keep your soul</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">fsharp            ; ML stands for Microsoft's Language</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">fstar             ; (dependent) types and (monadic) effects and Z3</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">gdscript          ; the language you waited for</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(go +lsp)         ; the hipster dialect</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(graphql +lsp)    ; Give queries a REST</span>
&#9474;      <span style="color: #d33682;">(</span>haskell +lsp<span style="color: #d33682;">)</span>    <span style="color: #405A61;">; </span><span style="color: #405A61;">a language that's lazier than I am</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">hy                ; readability of scheme w/ speed of python</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">idris             ; a language you can depend on</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">json              ; At least it ain't XML</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(java +lsp)       ; the poster child for carpal tunnel syndrome</span>
&#9474;      javascript        <span style="color: #405A61;">; </span><span style="color: #405A61;">all(hope(abandon(ye(who(enter(here))))))</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">julia             ; a better, faster MATLAB</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">kotlin            ; a better, slicker Java(Script)</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">latex             ; writing papers in Emacs has never been so fun</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">lean              ; for folks with too much to prove</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ledger            ; be audit you can be</span>
&#9474;      <span style="color: #d33682;">(</span>lua +lsp<span style="color: #d33682;">)</span>        <span style="color: #405A61;">; </span><span style="color: #405A61;">one-based indices? one-based indices</span>
&#9474;      <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">markdown</span> +grip<span style="color: #d33682;">)</span>  <span style="color: #405A61;">; </span><span style="color: #405A61;">writing docs for people to ignore</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">nim               ; python + lisp at the speed of c</span>
&#9474;      nix               <span style="color: #405A61;">; </span><span style="color: #405A61;">I hereby declare "nix geht mehr!"</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">ocaml             ; an objective camel</span>
&#9474;      <span style="color: #d33682;">(</span>org +dragndrop +gnuplot +pandoc +pretty +roam2<span style="color: #d33682;">)</span>  <span style="color: #405A61;">; </span><span style="color: #405A61;">organize your plain life in plain text</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">php               ; perl's insecure younger brother</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">plantuml          ; diagrams for confusing people more</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">purescript        ; javascript, but functional</span>
&#9474;      <span style="color: #d33682;">(</span>python +lsp<span style="color: #d33682;">)</span>     <span style="color: #405A61;">; </span><span style="color: #405A61;">beautiful is better than ugly</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">qt                ; the '</span><span style="color: #d33682; font-weight: bold;">cutest</span><span style="color: #405A61;">' gui framework ever</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">racket            ; a DSL for DSLs</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">raku              ; the artist formerly known as perl6</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">rest              ; Emacs as a REST client</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">rst               ; ReST in peace</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? '</span><span style="color: #d33682; font-weight: bold;">love</span><span style="color: #405A61;">' : '</span><span style="color: #d33682; font-weight: bold;">life</span><span style="color: #405A61;">'}"}</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">scala             ; java, but good</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(scheme +guile)   ; a fully conniving family of lisps</span>
&#9474;      <span style="color: #d33682;">(</span>sh +lsp<span style="color: #d33682;">)</span>         <span style="color: #405A61;">; </span><span style="color: #405A61;">she sells {ba,z,fi}sh shells on the C xor</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">sml</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">solidity          ; do you need a blockchain? No.</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">swift             ; who asked for emoji variables?</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">terra             ; Earth and Moon in alignment for performance.</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">web               ; the tubes</span>
&#9474;      <span style="color: #d33682;">(</span>yaml +lsp<span style="color: #d33682;">)</span>       <span style="color: #405A61;">; </span><span style="color: #405A61;">JSON, but readable</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">zig               ; C, but simpler</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:email</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(mu4e +org +gmail)</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">notmuch</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(wanderlust +gmail)</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:app</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">calendar</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">emms</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">everywhere        ; *leave* Emacs!? You must be joking</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">irc               ; how neckbeards socialize</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">(rss +org)        ; emacs as an RSS reader</span>
&#9474;      <span style="color: #405A61;">;;</span><span style="color: #405A61;">twitter           ; twitter client https://twitter.com/vnought</span>
&#9474;
&#9474;      <span style="color: #268bd2;">:config</span>
&#9474;      literate
&#9474;      <span style="color: #d33682;">(</span>default +bindings +smartparens<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
