emacs/doom/config.org
* Configuration
** User Information

My personal information.
#+begin_src emacs-lisp
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets. It is optional.
(setq user-full-name "Ben Melton"
      user-mail-address "ben@themeltons.net")
#+end_src

** Mac Settings

Special packages and configuration options for the Mac.

*** UI behavior

Assign modifier keys and disable passing Control characters to the system, to avoid that =C-M-space= launches the Character viewer instead of running =mark-sexp=.
#+begin_src emacs-lisp
(cond ((featurep :system 'macos)
       (setq mac-command-modifier       'meta
             mac-option-modifier        'alt
             mac-right-option-modifier  'alt
             mac-pass-control-to-system nil)))
#+end_src

*** Authentication source order

Doom configures =auth-sources= by default to include the Keychain on macOS, but it puts it at the beginning of the list. This causes creation of auth items to fail because the macOS Keychain sources do not support creation yet. Reverse it to leave =~/.authinfo.gpg= at the beginning.
#+begin_src emacs-lisp
(cond ((featurep :system 'macos)
       (after! auth-source
         (setq auth-sources (nreverse auth-sources)))))
#+end_src

*** Capturing links to external applications

=org-mac-link= implements the ability to grab links from different Mac apps and insert them in the file. Bind =C-c g= to call =org-mac-grab-link= to choose an application and insert a link.
#+begin_src emacs-lisp :tangle packages.el
(when (featurep :system 'macos)
  (package! org-mac-link))
#+end_src
#+begin_src emacs-lisp
(when (featurep :system 'macos)
  (use-package! org-mac-link
    :after org
    :config
    (setq org-mac-grab-Acrobat-app-p nil) ; Disable grabbing from Adobe Acrobat
    (map! :map org-mode-map
          "C-c g"  #'org-mac-grab-link)))
#+end_src

** [[https://github.com/doomemacs/doomemacs][Doom]]/[[https://www.gnu.org/software/emacs/][Emacs]]
*** Fonts

#+begin_src emacs-lisp
;; Doom exposes five (optional) variables for controlling fonts in Doom:
;;
;; - `doom-font' -- the primary font to use
;; - `doom-variable-pitch-font' -- a non-monospace font (where applicable)
;; - `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;; - `doom-unicode-font' -- for unicode glyphs
;; - `doom-serif-font' -- for the `fixed-pitch-serif' face
;;
;; See 'C-h v doom-font' for documentation and more examples of what they
;; accept. For example:
;;
;;(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
;;      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))
(setq doom-font (font-spec :family "FiraCode Nerd Font" :size 11 :weight 'semi-light))
;;
;; If you or Emacs can't find your font, use 'M-x describe-font' to look them
;; up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to
;; refresh your font settings. If Emacs still can't find your font, it likely
;; wasn't installed correctly. Font issues are rarely Doom issues!
#+end_src

