emacs/doom/config.html
<div id="outline-container-org2ad7a79" class="outline-2">
<h2 id="org2ad7a79">Configuration</h2>
<div class="outline-text-2" id="text-org2ad7a79">
</div>
<div id="outline-container-orgf21ad20" class="outline-3">
<h3 id="orgf21ad20">User Information</h3>
<div class="outline-text-3" id="text-orgf21ad20">
<p>
My personal information.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;; </span><span style="color: #405A61;">Some functionality uses this to identify you, e.g. GPG configuration, email</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">clients, file templates and snippets. It is optional.</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">user-full-name</span> <span style="color: #2aa198;">"Ben Melton"</span>
&#9474;     <span style="color: #6c71c4;">user-mail-address</span> <span style="color: #2aa198;">"ben@themeltons.net"</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0cfe374" class="outline-3">
<h3 id="org0cfe374">Mac Settings</h3>
<div class="outline-text-3" id="text-org0cfe374">
<p>
Special packages and configuration options for the Mac.
</p>
</div>
<div id="outline-container-orgc293153" class="outline-4">
<h4 id="orgc293153">UI behavior</h4>
<div class="outline-text-4" id="text-orgc293153">
<p>
Assign modifier keys and disable passing Control characters to the system, to avoid that <code>C-M-space</code> launches the Character viewer instead of running <code>mark-sexp</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">featurep</span> <span style="color: #d33682; font-weight: bold;">:system</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">macos</span><span style="color: #859900;">)</span>
&#9474;      <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">mac-command-modifier</span>       <span style="color: #cb4b16;">'</span><span style="color: #b58900;">meta</span>
&#9474; &#9474; &#9474; &#9474; &#9474;    <span style="color: #6c71c4;">mac-option-modifier</span>        <span style="color: #cb4b16;">'</span><span style="color: #b58900;">alt</span>
&#9474; &#9474; &#9474; &#9474; &#9474;    <span style="color: #6c71c4;">mac-right-option-modifier</span>  <span style="color: #cb4b16;">'</span><span style="color: #b58900;">alt</span>
&#9474; &#9474; &#9474; &#9474; &#9474;    mac-pass-control-to-system nil<span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbcde564" class="outline-4">
<h4 id="orgbcde564">Authentication source order</h4>
<div class="outline-text-4" id="text-orgbcde564">
<p>
Doom configures <code>auth-sources</code> by default to include the Keychain on macOS, but it puts it at the beginning of the list. This causes creation of auth items to fail because the macOS Keychain sources do not support creation yet. Reverse it to leave <code>~/.authinfo.gpg</code> at the beginning.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">featurep</span> <span style="color: #d33682; font-weight: bold;">:system</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">macos</span><span style="color: #859900;">)</span>
&#9474;      <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">after!</span> auth-source
&#9474; &#9474; &#9474; &#9474; &#9474;<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">auth-sources</span> <span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">nreverse</span> <span style="color: #6c71c4;">auth-sources</span><span style="color: #268bd2;">)</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9976e39" class="outline-4">
<h4 id="org9976e39">Capturing links to external applications</h4>
<div class="outline-text-4" id="text-org9976e39">
<p>
<code>org-mac-link</code> implements the ability to grab links from different Mac apps and insert them in the file. Bind <code>C-c g</code> to call <code>org-mac-grab-link</code> to choose an application and insert a link.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">when</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">featurep</span> <span style="color: #d33682; font-weight: bold;">:system</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">macos</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">package!</span> org-mac-link<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">when</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">featurep</span> <span style="color: #d33682; font-weight: bold;">:system</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">macos</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> org-mac-link
&#9474; &#9474; <span style="color: #268bd2;">:after</span> org
&#9474; &#9474; <span style="color: #268bd2;">:config</span>
&#9474; &#9474; <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">setq</span> org-mac-grab-Acrobat-app-p nil<span style="color: #859900;">)</span> <span style="color: #405A61;">; </span><span style="color: #405A61;">Disable grabbing from Adobe Acrobat</span>
&#9474; &#9474; <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">map!</span> <span style="color: #268bd2;">:map</span> <span style="color: #6c71c4;">org-mode-map</span>
&#9474; &#9474; &#9474;     <span style="color: #2aa198;">"C-c g"</span>  <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">org-mac-grab-link</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7d3998e" class="outline-3">
<h3 id="org7d3998e"><a href="https://github.com/doomemacs/doomemacs">Doom</a>/<a href="https://www.gnu.org/software/emacs/">Emacs</a></h3>
<div class="outline-text-3" id="text-org7d3998e">
</div>
<div id="outline-container-orga9dea7f" class="outline-4">
<h4 id="orga9dea7f">Fonts</h4>
<div class="outline-text-4" id="text-orga9dea7f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;; </span><span style="color: #405A61;">Doom exposes five (optional) variables for controlling fonts in Doom:</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">doom-font</span><span style="color: #405A61;">' -- the primary font to use</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">doom-variable-pitch-font</span><span style="color: #405A61;">' -- a non-monospace font (where applicable)</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">doom-big-font</span><span style="color: #405A61;">' -- used for `</span><span style="color: #d33682; font-weight: bold;">doom-big-font-mode</span><span style="color: #405A61;">'; use this for</span>
<span style="color: #405A61;">;;   </span><span style="color: #405A61;">presentations or streaming.</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">doom-unicode-font</span><span style="color: #405A61;">' -- for unicode glyphs</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">- `</span><span style="color: #d33682; font-weight: bold;">doom-serif-font</span><span style="color: #405A61;">' -- for the `</span><span style="color: #d33682; font-weight: bold;">fixed-pitch-serif</span><span style="color: #405A61;">' face</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">See 'C-h v doom-font' for documentation and more examples of what they</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">accept. For example:</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;;</span><span style="color: #405A61;">(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)</span>
<span style="color: #405A61;">;;      </span><span style="color: #405A61;">doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">doom-font</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">font-spec</span> <span style="color: #268bd2;">:family</span> <span style="color: #2aa198;">"FiraCode Nerd Font"</span> <span style="color: #268bd2;">:size</span> <span style="color: #d33682; font-weight: bold;">11</span> <span style="color: #268bd2;">:weight</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">semi-light</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #405A61;">;;</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">If you or Emacs can't find your font, use 'M-x describe-font' to look them</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">up, `M-x eval-region' to execute elisp code, and 'M-x doom/reload-font' to</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">refresh your font settings. If Emacs still can't find your font, it likely</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">wasn't installed correctly. Font issues are rarely Doom issues!</span>
</pre>
</div>
</div>
</div>
