emacs/doom/config.org
*** Themes

First, let's get all the themes loaded.
#+begin_src emacs-lisp :tangle packages.el
(package! doom-themes)
#+end_src

I like the dark Solarized theme. It's easy on the eyes.
#+begin_src emacs-lisp
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-solarized-dark)
#+end_src

*** Appearance
**** Line Numbering

I like line numbers.
#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src

**** Word Counter

Enable a word count in the modeline. This is only shown for the modes listed in =doom-modeline-continuous-word-count-modes= (Markdown, GFM and Org by default).
#+begin_src emacs-lisp
(setq doom-modeline-enable-word-count t)
#+end_src

**** [[https://github.com/doomemacs/doomemacs/tree/master/modules/ui/ligatures][Ligatures]]

I don't like ligatures in certain modes, such as =verilog-mode=. So, let's negate ligatures in these modes.
#+begin_src emacs-lisp
(after! ligature
  (setq ligature-ignored-major-modes
        (cl-union ligature-ignored-major-modes '(verilog-mode
                                                 verilog-ts-mode))))
#+end_src

*** Key Bindings

TODO

*** Auto Save & Backup Files

We want the safety of auto-save and backup files.
#+begin_src emacs-lisp
(setq auto-save-default t
      make-backup-files t)
#+end_src

** [[https://orgmode.org/][Org-Mode]]

First, let's ensure we set the default source directory.
#+begin_src emacs-lisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")
#+end_src

*** Appearance
**** Indentation

Each hierarchy adds two spaces of indentation by default. In order to save horizontal space when editing, change this to one space.
#+begin_src emacs-lisp
(after! org
  (setq org-indent-indentation-per-level 1))
#+end_src

We also want to ensure Org does not add extra indentation to the text to match the heading.
#+begin_src emacs-lisp
(after! org
  (setq org-adapt-indentation nil))
#+end_src

**** Visuals

Let's hide the (N-1) stars of a heading to reduce visual noise.
#+begin_src emacs-lisp
(after! org
  (setq org-hide-leading-stars 't))
#+end_src

Hide emphasis and other markup until it actually needs to be edited.
#+begin_src emacs-lisp
(after! org
  (setq org-hide-emphasis-markers t))
#+end_src

**** Behavior

Insert Org headings at point, not after the current subtree (this is enabled by default by Doom).
#+begin_src emacs-lisp
(after! org (setq org-insert-heading-respect-content nil))
#+end_src

