emacs/doom/config.html
<div id="outline-container-org54cb166" class="outline-4">
<h4 id="org54cb166">Themes</h4>
<div class="outline-text-4" id="text-org54cb166">
<p>
First, let&rsquo;s get all the themes loaded.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> doom-themes<span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
I like the dark Solarized theme. It&rsquo;s easy on the eyes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;; </span><span style="color: #405A61;">There are two ways to load a theme. Both assume the theme is installed and</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">available. You can either set `</span><span style="color: #d33682; font-weight: bold;">doom-theme</span><span style="color: #405A61;">' or manually load a theme with the</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">`</span><span style="color: #d33682; font-weight: bold;">load-theme</span><span style="color: #405A61;">' function. This is the default:</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">doom-theme</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">doom-solarized-dark</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2337d74" class="outline-4">
<h4 id="org2337d74">Appearance</h4>
<div class="outline-text-4" id="text-org2337d74">
</div>
<ul class="org-ul">
<li><a id="orgf54c5a2"></a>Line Numbering<br />
<div class="outline-text-5" id="text-orgf54c5a2">
<p>
I like line numbers.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;; </span><span style="color: #405A61;">This determines the style of line numbers in effect. If set to `</span><span style="color: #d33682; font-weight: bold;">nil</span><span style="color: #405A61;">', line</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">numbers are disabled. For relative line numbers, set this to `</span><span style="color: #d33682; font-weight: bold;">relative</span><span style="color: #405A61;">'.</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">display-line-numbers-type</span> t<span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgcd5a79a"></a>Word Counter<br />
<div class="outline-text-5" id="text-orgcd5a79a">
<p>
Enable a word count in the modeline. This is only shown for the modes listed in <code>doom-modeline-continuous-word-count-modes</code> (Markdown, GFM and Org by default).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">doom-modeline-enable-word-count</span> t<span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgb7c077c"></a><a href="https://github.com/doomemacs/doomemacs/tree/master/modules/ui/ligatures">Ligatures</a><br />
<div class="outline-text-5" id="text-orgb7c077c">
<p>
I don&rsquo;t like ligatures in certain modes, such as <code>verilog-mode</code>. So, let&rsquo;s negate ligatures in these modes.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> ligature
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">ligature-ignored-major-modes</span>
&#9474; &#9474;     <span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">cl-union</span> <span style="color: #6c71c4;">ligature-ignored-major-modes</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">(</span>verilog-mode
&#9474; &#9474; &#9474; &#9474; &#9474;                                        verilog-ts-mode<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge0d75c8" class="outline-4">
<h4 id="orge0d75c8">Key Bindings</h4>
<div class="outline-text-4" id="text-orge0d75c8">
<p>
TODO
</p>
</div>
</div>
<div id="outline-container-orgfeb81d6" class="outline-4">
<h4 id="orgfeb81d6">Auto Save &amp; Backup Files</h4>
<div class="outline-text-4" id="text-orgfeb81d6">
<p>
We want the safety of auto-save and backup files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">auto-save-default</span> t
&#9474;     <span style="color: #6c71c4;">make-backup-files</span> t<span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1ae66b7" class="outline-3">
<h3 id="org1ae66b7"><a href="https://orgmode.org/">Org-Mode</a></h3>
<div class="outline-text-3" id="text-org1ae66b7">
<p>
First, let&rsquo;s ensure we set the default source directory.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #405A61;">;; </span><span style="color: #405A61;">If you use `</span><span style="color: #d33682; font-weight: bold;">org</span><span style="color: #405A61;">' and don't want your org files in the default location below,</span>
<span style="color: #405A61;">;; </span><span style="color: #405A61;">change `</span><span style="color: #d33682; font-weight: bold;">org-directory</span><span style="color: #405A61;">'. It must be set before org loads!</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-directory</span> <span style="color: #2aa198;">"~/org/"</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgbbb55cd" class="outline-4">
<h4 id="orgbbb55cd">Appearance</h4>
<div class="outline-text-4" id="text-orgbbb55cd">
</div>
<ul class="org-ul">
<li><a id="org4af8448"></a>Indentation<br />
<div class="outline-text-5" id="text-org4af8448">
<p>
Each hierarchy adds two spaces of indentation by default. In order to save horizontal space when editing, change this to one space.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-indent-indentation-per-level</span> <span style="color: #d33682; font-weight: bold;">1</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
We also want to ensure Org does not add extra indentation to the text to match the heading.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-adapt-indentation</span> nil<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org3092073"></a>Visuals<br />
<div class="outline-text-5" id="text-org3092073">
<p>
Let&rsquo;s hide the (N-1) stars of a heading to reduce visual noise.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-hide-leading-stars</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Hide emphasis and other markup until it actually needs to be edited.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-hide-emphasis-markers</span> t<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org9547995"></a>Behavior<br />
<div class="outline-text-5" id="text-org9547995">
<p>
Insert Org headings at point, not after the current subtree (this is enabled by default by Doom).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-insert-heading-respect-content</span> nil<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
