emacs/doom/config.org
*** [[https://github.com/awth13/org-appear][Org-Appear]]

Reveals hidden entities such as emphasis markers when moving the cursor over them.
#+begin_src emacs-lisp :tangle packages.el
(package! org-appear
  :recipe (:host github
           :repo "awth13/org-appear"))
#+end_src

#+begin_src emacs-lisp
(use-package! org-appear
  :defer t
  :hook (org-mode . org-appear-mode))
#+end_src

We want to reveal all Org entities.
#+begin_src emacs-lisp
(after! org-appear
  (setq org-appear-autoemphasis t)
  (setq org-appear-autolinks t)
  (setq org-appear-autosubmarkers t)
  (setq org-appear-autoentities t)
  (setq org-appear-autokeywords t)
  (setq org-appear-inside-latex t))
#+end_src

Let's create a hook to reveal only when we are in =evil-mode='s insert mode. Note that org-appear expects to be enabled in Org mode buffers only, which is why the example attaches evil-mode hooks to the Org mode startup hook.
#+begin_src emacs-lisp
(after! org-appear
  (setq org-appear-trigger 'manual)
  (add-hook 'org-mode-hook (lambda ()
                             (add-hook 'evil-insert-state-entry-hook
                                       #'org-appear-manual-start
                                       nil
                                       t)
                             (add-hook 'evil-insert-state-exit-hook
                                       #'org-appear-manual-stop
                                       nil
                                       t))))
#+end_src

*** [[https://github.com/yilkalargaw/org-auto-tangle][Org-Auto-Tangle]]

Automatically runs =org-babel-tangle= upon saving any =org-mode= buffer.
#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src

#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

*** [[https://github.com/org-roam/org-roam][Org-Roam]]

Creates a highly interconnected knowledge database called a Zettelkasten.

*** [[https://github.com/org-roam/org-roam-ui][Org-Roam-UI]]

Renders the =org-roam= Zettelkasten in a web browser.

First, we need to unpin Doom's =org-roam= to ensure we have the latest and greatest.
#+begin_src emacs-lisp :tangle packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

Enable websockets for browser integration and configure the package. These are done after org-roam is loaded to reduce impact on Doom startup time.
#+begin_src emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

** (System)Verilog
