emacs/doom/config.html
<div id="outline-container-org4652c1a" class="outline-4">
<h4 id="org4652c1a"><a href="https://github.com/awth13/org-appear">Org-Appear</a></h4>
<div class="outline-text-4" id="text-org4652c1a">
<p>
Reveals hidden entities such as emphasis markers when moving the cursor over them.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> org-appear
&#9474; <span style="color: #268bd2;">:recipe</span> <span style="color: #d33682;">(</span><span style="color: #268bd2;">:host</span> github
&#9474; &#9474;        <span style="color: #268bd2;">:repo</span> <span style="color: #2aa198;">"awth13/org-appear"</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> org-appear
&#9474; <span style="color: #268bd2;">:defer</span> t
&#9474; <span style="color: #268bd2;">:hook</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">org-mode</span> . <span style="color: #6c71c4;">org-appear-mode</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
We want to reveal all Org entities.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org-appear
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-autoemphasis</span> t<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-autolinks</span> t<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-autosubmarkers</span> t<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-autoentities</span> t<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-autokeywords</span> t<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-inside-latex</span> t<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Let&rsquo;s create a hook to reveal only when we are in <code>evil-mode</code>&rsquo;s insert mode. Note that org-appear expects to be enabled in Org mode buffers only, which is why the example attaches evil-mode hooks to the Org mode startup hook.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> org-appear
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-appear-trigger</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">manual</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">add-hook</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">org-mode-hook</span> <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #6c71c4;">()</span>
&#9474; &#9474;                          <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">add-hook</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">evil-insert-state-entry-hook</span>
&#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474;        <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">org-appear-manual-start</span>
&#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474;        nil
&#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474;        t<span style="color: #6c71c4;">)</span>
&#9474; &#9474;                          <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">add-hook</span> <span style="color: #cb4b16;">'</span><span style="color: #6c71c4;">evil-insert-state-exit-hook</span>
&#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474;        <span style="color: #cb4b16;">#'</span><span style="color: #b58900;">org-appear-manual-stop</span>
&#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474;        nil
&#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474; &#9474;        t<span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0d6e18" class="outline-4">
<h4 id="orgd0d6e18"><a href="https://github.com/yilkalargaw/org-auto-tangle">Org-Auto-Tangle</a></h4>
<div class="outline-text-4" id="text-orgd0d6e18">
<p>
Automatically runs <code>org-babel-tangle</code> upon saving any <code>org-mode</code> buffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> org-auto-tangle<span style="color: #268bd2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> org-auto-tangle
&#9474; <span style="color: #268bd2;">:defer</span> t
&#9474; <span style="color: #268bd2;">:hook</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">org-mode</span> . <span style="color: #6c71c4;">org-auto-tangle-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #268bd2;">:config</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-auto-tangle-default</span> t<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfafb038" class="outline-4">
<h4 id="orgfafb038"><a href="https://github.com/org-roam/org-roam">Org-Roam</a></h4>
<div class="outline-text-4" id="text-orgfafb038">
<p>
Creates a highly interconnected knowledge database called a Zettelkasten.
</p>
</div>
</div>
<div id="outline-container-org23c5757" class="outline-4">
<h4 id="org23c5757"><a href="https://github.com/org-roam/org-roam-ui">Org-Roam-UI</a></h4>
<div class="outline-text-4" id="text-org23c5757">
<p>
Renders the <code>org-roam</code> Zettelkasten in a web browser.
</p>

<p>
First, we need to unpin Doom&rsquo;s <code>org-roam</code> to ensure we have the latest and greatest.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">unpin!</span> org-roam<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> org-roam-ui<span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Enable websockets for browser integration and configure the package. These are done after org-roam is loaded to reduce impact on Doom startup time.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> websocket
&#9474;   <span style="color: #268bd2;">:after</span> org-roam<span style="color: #268bd2;">)</span>
&#9474;
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> org-roam-ui
&#9474;   <span style="color: #268bd2;">:after</span> org-roam <span style="color: #405A61;">;; </span><span style="color: #405A61;">or :after org</span>
<span style="color: #405A61;">;;         </span><span style="color: #405A61;">normally we'd recommend hooking orui after org-roam, but since org-roam does not have</span>
<span style="color: #405A61;">;;         </span><span style="color: #405A61;">a hookable mode anymore, you're advised to pick something yourself</span>
<span style="color: #405A61;">;;         </span><span style="color: #405A61;">if you don't care about startup time, use</span>
<span style="color: #405A61;">;;  </span><span style="color: #405A61;">:hook (after-init . org-roam-ui-mode)</span>
&#9474;   <span style="color: #268bd2;">:config</span>
&#9474;   <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">org-roam-ui-sync-theme</span> t
&#9474; &#9474; &#9474;     <span style="color: #6c71c4;">org-roam-ui-follow</span> t
&#9474; &#9474; &#9474;     <span style="color: #6c71c4;">org-roam-ui-update-on-save</span> t
&#9474; &#9474; &#9474;     <span style="color: #6c71c4;">org-roam-ui-open-on-start</span> t<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
</div>
