emacs/doom/packages.el

;; Reveals hidden entities such as emphasis markers when moving the cursor over them.

;; [[file:config.org::*\[\[https:/github.com/awth13/org-appear\]\[Org-Appear\]\]][[[https://github.com/awth13/org-appear][Org-Appear]]:1]]
(package! org-appear
  :recipe (:host github
           :repo "awth13/org-appear"))
;; [[https://github.com/awth13/org-appear][Org-Appear]]:1 ends here

;; [[https://github.com/yilkalargaw/org-auto-tangle][Org-Auto-Tangle]]

;; Automatically runs =org-babel-tangle= upon saving any =org-mode= buffer.

;; [[file:config.org::*\[\[https:/github.com/yilkalargaw/org-auto-tangle\]\[Org-Auto-Tangle\]\]][[[https://github.com/yilkalargaw/org-auto-tangle][Org-Auto-Tangle]]:1]]
(package! org-auto-tangle)
;; [[https://github.com/yilkalargaw/org-auto-tangle][Org-Auto-Tangle]]:1 ends here

;; [[https://github.com/org-roam/org-roam-ui][Org-Roam-UI]]

;; Renders the =org-roam= Zettelkasten in a web browser.

;; First, we need to unpin Doom's =org-roam= to ensure we have the latest and greatest.

;; [[file:config.org::*\[\[https:/github.com/org-roam/org-roam-ui\]\[Org-Roam-UI\]\]][[[https://github.com/org-roam/org-roam-ui][Org-Roam-UI]]:1]]
(unpin! org-roam)
(package! org-roam-ui)
;; [[https://github.com/org-roam/org-roam-ui][Org-Roam-UI]]:1 ends here

;; [[https://github.com/veripool/verilog-mode][Verilog-Mode]]
