emacs/doom/config.org
*** [[https://github.com/veripool/verilog-mode][Verilog-Mode]]

Provides basic support for Verilog editing, including autos.
#+begin_src emacs-lisp :tangle packages.el
(package! verilog-mode)
#+end_src

Load the module by default for =*.v=, =*.vh=, =*.sv= and =*.svh= files.
#+begin_src emacs-lisp
(use-package! verilog-mode
  :mode "\\.s?vh?\\'")
#+end_src

*** [[https://github.com/gmlarumbe/verilog-ts-mode][Verilog-Ts-Mode]]

Provides syntax highlighting, indentation, =imenu=, =which-func=, navigation and basic beautify and completion features. It is derived from =verilog-mode= making AUTOs and other utilities still available.
#+begin_src emacs-lisp :tangle packages.el
(package! verilog-ts-mode)
#+end_src

Load the module only if tree-sitter support is available. We want to use tree-sitter by default for =*.v=, =*.sv=, =*.vh=, and =*.svh= files.
#+begin_src emacs-lisp
(use-package! verilog-ts-mode
  :if (treesit-available-p)
  :mode "\\.s?vh?\\'")
#+end_src

*** [[https://github.com/gmlarumbe/verilog-ext][Verilog-Ext]]

Provides advanced editing features for Verilog or SystemVerilog code.
#+begin_src emacs-lisp :tangle packages.el
(package! verilog-ext)
#+end_src

=verilog-ext-feature-list= selects enabled features.
#+begin_src emacs-lisp
(use-package! verilog-ext
  :hook ((verilog-mode . verilog-ext-mode))
  :init
  ;; Can also be set through `M-x RET customize-group RET verilog-ext':
  ;; Comment out/remove the ones you do not need
  (setq verilog-ext-feature-list
        '(font-lock
          xref
          capf
          hierarchy
          eglot
          lsp
;          lsp-bridge
;          lspce
          flycheck
          beautify
          navigation
          template
          formatter
          compilation
          imenu
          which-func
          hideshow
          typedefs
          time-stamp
          block-end-comments
          ports))
  :config
  (verilog-ext-mode-setup))
#+end_src

*** Appearance
**** Highlighting

Let's have pretty syntax.
#+begin_src emacs-lisp
(after! (verilog-mode)
  (setq verilog-fontify-variables               't
        verilog-highlight-grouping-keywords     't
        verilog-highlight-includes              't
        verilog-highlight-max-lookahead     100000
        verilog-highlight-modules               't))
#+end_src

**** Indentation

Always indent and match indentation with each item whenever possible, but I don't like =begin= indented after an =if=.
#+begin_src emacs-lisp
(after! (verilog-mode)
  (setq verilog-auto-indent-on-newline           't
        verilog-indent-lists                     't
        verilog-indent-begin-after-if           nil
        verilog-indent-class-inside-pkg          't
        verilog-indent-declaration-macros       nil
        verilog-indent-ignore-multiline-defines nil
        verilog-tab-always-indent                't))
#+end_src

Two spaces of indentation in general.
#+begin_src emacs-lisp
(after! (verilog-mode)
  (setq verilog-indent-level             2
        verilog-indent-level-behavioral  2
        verilog-indent-level-declaration 2
        verilog-indent-level-directive   2
        verilog-indent-level-module      2
        verilog-case-indent              2
        verilog-cexp-indent              2))

(after! (verilog-ts-mode)
  (setq verilog-ts-indent-level 2))

(after! (verilog-ext)
  (setq verilog-ext-formatter-indentation-spaces 2))
#+end_src

