emacs/doom/config.html
<div id="outline-container-org06a853b" class="outline-3">
<h3 id="org06a853b">(System)Verilog</h3>
<div class="outline-text-3" id="text-org06a853b">
</div>
<div id="outline-container-orga95b15b" class="outline-4">
<h4 id="orga95b15b"><a href="https://github.com/veripool/verilog-mode">Verilog-Mode</a></h4>
<div class="outline-text-4" id="text-orga95b15b">
<p>
Provides basic support for Verilog editing, including autos.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> verilog-mode<span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Load the module by default for <code>*.v</code>, <code>*.vh</code>, <code>*.sv</code> and <code>*.svh</code> files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> verilog-mode
&#9474; <span style="color: #268bd2;">:mode</span> <span style="color: #2aa198;">"\\.s?vh?\\'"</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org196366b" class="outline-4">
<h4 id="org196366b"><a href="https://github.com/gmlarumbe/verilog-ts-mode">Verilog-Ts-Mode</a></h4>
<div class="outline-text-4" id="text-org196366b">
<p>
Provides syntax highlighting, indentation, <code>imenu</code>, <code>which-func</code>, navigation and basic beautify and completion features. It is derived from <code>verilog-mode</code> making AUTOs and other utilities still available.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> verilog-ts-mode<span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Load the module only if tree-sitter support is available. We want to use tree-sitter by default for <code>*.v</code>, <code>*.sv</code>, <code>*.vh</code>, and <code>*.svh</code> files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> verilog-ts-mode
&#9474; <span style="color: #268bd2;">:if</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">treesit-available-p</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #268bd2;">:mode</span> <span style="color: #2aa198;">"\\.s?vh?\\'"</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ade045" class="outline-4">
<h4 id="org2ade045"><a href="https://github.com/gmlarumbe/verilog-ext">Verilog-Ext</a></h4>
<div class="outline-text-4" id="text-org2ade045">
<p>
Provides advanced editing features for Verilog or SystemVerilog code.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">package!</span> verilog-ext<span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
<code>verilog-ext-feature-list</code> selects enabled features.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">use-package!</span> verilog-ext
&#9474; <span style="color: #268bd2;">:hook</span> <span style="color: #d33682;">(</span><span style="color: #859900;">(</span><span style="color: #d33682; font-weight: bold;">verilog-mode</span> . <span style="color: #6c71c4;">verilog-ext-mode</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #268bd2;">:init</span>
&#9474; <span style="color: #405A61;">;; </span><span style="color: #405A61;">Can also be set through `M-x RET customize-group RET verilog-ext':</span>
&#9474; <span style="color: #405A61;">;; </span><span style="color: #405A61;">Comment out/remove the ones you do not need</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ext-feature-list</span>
&#9474; &#9474;     <span style="color: #cb4b16;">'</span><span style="color: #859900;">(</span>font-lock
&#9474; &#9474; &#9474; &#9474; &#9474; xref
&#9474; &#9474; &#9474; &#9474; &#9474; capf
&#9474; &#9474; &#9474; &#9474; &#9474; hierarchy
&#9474; &#9474; &#9474; &#9474; &#9474; eglot
&#9474; &#9474; &#9474; &#9474; &#9474; lsp
<span style="color: #405A61;">;          </span><span style="color: #405A61;">lsp-bridge</span>
<span style="color: #405A61;">;          </span><span style="color: #405A61;">lspce</span>
&#9474; &#9474; &#9474; &#9474; &#9474; flycheck
&#9474; &#9474; &#9474; &#9474; &#9474; beautify
&#9474; &#9474; &#9474; &#9474; &#9474; navigation
&#9474; &#9474; &#9474; &#9474; &#9474; template
&#9474; &#9474; &#9474; &#9474; &#9474; formatter
&#9474; &#9474; &#9474; &#9474; &#9474; compilation
&#9474; &#9474; &#9474; &#9474; &#9474; imenu
&#9474; &#9474; &#9474; &#9474; &#9474; which-func
&#9474; &#9474; &#9474; &#9474; &#9474; hideshow
&#9474; &#9474; &#9474; &#9474; &#9474; typedefs
&#9474; &#9474; &#9474; &#9474; &#9474; time-stamp
&#9474; &#9474; &#9474; &#9474; &#9474; block-end-comments
&#9474; &#9474; &#9474; &#9474; &#9474; ports<span style="color: #859900;">)</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #268bd2;">:config</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #268bd2;">verilog-ext-mode-setup</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca274a2" class="outline-4">
<h4 id="orgca274a2">Appearance</h4>
<div class="outline-text-4" id="text-orgca274a2">
</div>
<ul class="org-ul">
<li><a id="org8f47b22"></a>Highlighting<br />
<div class="outline-text-5" id="text-org8f47b22">
<p>
Let&rsquo;s have pretty syntax.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-fontify-variables</span>               <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-highlight-grouping-keywords</span>     <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-highlight-includes</span>              <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-highlight-max-lookahead</span>     <span style="color: #d33682; font-weight: bold;">100000</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-highlight-modules</span>               <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org5f809f0"></a>Indentation<br />
<div class="outline-text-5" id="text-org5f809f0">
<p>
Always indent and match indentation with each item whenever possible, but I don&rsquo;t like <code>begin</code> indented after an <code>if</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-auto-indent-on-newline</span>           <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-lists</span>                     <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-begin-after-if</span>           nil
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-class-inside-pkg</span>          <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-declaration-macros</span>       nil
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-ignore-multiline-defines</span> nil
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-tab-always-indent</span>                <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>

<p>
Two spaces of indentation in general.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-indent-level</span>             <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-level-behavioral</span>  <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-level-declaration</span> <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-level-directive</span>   <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-indent-level-module</span>      <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-case-indent</span>              <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-cexp-indent</span>              <span style="color: #d33682; font-weight: bold;">2</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
&#9474; &#9474;
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-ts-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ts-indent-level</span> <span style="color: #d33682; font-weight: bold;">2</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
&#9474;
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span>verilog-ext<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ext-formatter-indentation-spaces</span> <span style="color: #d33682; font-weight: bold;">2</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
