emacs/doom/packages.el

;; Provides basic support for Verilog editing, including autos.

;; [[file:config.org::*\[\[https:/github.com/veripool/verilog-mode\]\[Verilog-Mode\]\]][[[https://github.com/veripool/verilog-mode][Verilog-Mode]]:1]]
(package! verilog-mode)
;; [[https://github.com/veripool/verilog-mode][Verilog-Mode]]:1 ends here

;; [[https://github.com/gmlarumbe/verilog-ext][Verilog-Ext]]

;; Provides advanced editing features for Verilog or SystemVerilog code, including tree-sitter.

;; [[file:config.org::*\[\[https:/github.com/gmlarumbe/verilog-ext\]\[Verilog-Ext\]\]][[[https://github.com/gmlarumbe/verilog-ext][Verilog-Ext]]:1]]
(package! verilog-ext)
;; [[https://github.com/gmlarumbe/verilog-ext][Verilog-Ext]]:1 ends here
