emacs/doom/config.org
**** Alignment

In general, automatically align expressions whenever possible.
#+begin_src emacs-lisp
(after! (verilog-mode)
  (setq verilog-auto-lineup              'all
        verilog-align-assign-expr          't
        verilog-align-decl-expr-comments   't
        verilog-align-comment-distance      2
        verilog-align-ifelse               't))

(after! (verilog-ts-mode)
  (setq verilog-ts-align-decl-expr-comments 't))
#+end_src

*** Behavior

Automatically generate a newline after typing =;=, but don't tab to a comment. We have =evil-mode='s =A= command for that.
#+begin_src emacs-lisp
(after! (verilog-mode)
  (setq verilog-auto-newline    't
        verilog-tab-to-comment nil))
#+end_src

*** Completion

Let's use =tree-sitter= for completion if it is available.
#+begin_src emacs-lisp
(after! (verilog-ext)
  (setq verilog-ext-tags-backend
        (if (treesit-available-p)
            'tree-sitter
          'builtin)))
#+end_src

*** Hierarchy

Let's use [[https://github.com/veripool/verilog-perl][verilog-perl]]'s [[https://metacpan.org/pod/vhier][vhier]] tool to extract hierarchy if it is available, otherwise use =tree-sitter=.
#+begin_src emacs-lisp
(after! (verilog-ext)
  (setq verilog-ext-hierarchy-backend
        (cond ((executable-find "vhier") 'vhier)
              ((treesit-available-p) 'tree-sitter)
              (t 'builtin))))
#+end_src

*** Templates

Set some sane defaults for templating.
#+begin_src emacs-lisp
(after! (verilog-ext)
  (setq verilog-ext-template-clock              "clk"
        verilog-ext-template-reset            "rst_n"
        verilog-ext-template-reset-active-low      't))
#+end_src

*** Linting
** TRAMP
*** MS Windows
**** [[https://emacs.stackexchange.com/questions/76120/how-can-i-use-tramps-ssh-on-windows-10-with-the-native-ssh-exe][Native SSH Pseudo-Terminal]]

Since no "pseudo-terminal" is allocated, the classic PS1 is missing and TRAMP does not detect the prompt. We have to adjust the login arguments.

In order to force the allocation of a pseudo-terminal, we have to supply -tt as additional argument.
#+begin_src emacs-lisp
(when (eq system-type 'windows-nt)
  (require 'cl-lib)
  (with-eval-after-load 'tramp
    (cl-pushnew '("-tt")
                (car (alist-get 'tramp-login-args
                                (cdr (assoc "ssh" tramp-methods))))
                :test #'equal)))
#+end_src
