emacs/doom/config.html
<li><a id="org46d6fb8"></a>Alignment<br />
<div class="outline-text-5" id="text-org46d6fb8">
<p>
In general, automatically align expressions whenever possible.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-auto-lineup</span>              <span style="color: #cb4b16;">'</span><span style="color: #b58900;">all</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-align-assign-expr</span>          <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-align-decl-expr-comments</span>   <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-align-comment-distance</span>      <span style="color: #d33682; font-weight: bold;">2</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-align-ifelse</span>               <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
&#9474; &#9474;
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-ts-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ts-align-decl-expr-comments</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6fae1d8" class="outline-4">
<h4 id="org6fae1d8">Behavior</h4>
<div class="outline-text-4" id="text-org6fae1d8">
<p>
Automatically generate a newline after typing <code>;</code>, but don&rsquo;t tab to a comment. We have <code>evil-mode</code>&rsquo;s <code>A</code> command for that.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span><span style="color: #d33682; font-weight: bold;">verilog-mode</span><span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-auto-newline</span>    <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-tab-to-comment</span> nil<span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga31a084" class="outline-4">
<h4 id="orga31a084">Completion</h4>
<div class="outline-text-4" id="text-orga31a084">
<p>
Let&rsquo;s use <code>tree-sitter</code> for completion if it is available.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span>verilog-ext<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ext-tags-backend</span>
&#9474; &#9474;     <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span><span style="color: #d33682; font-weight: bold;">treesit-available-p</span><span style="color: #6c71c4;">)</span>
&#9474; &#9474; &#9474; &#9474; &#9474;   <span style="color: #cb4b16;">'</span><span style="color: #b58900;">tree-sitter</span>
&#9474; &#9474; &#9474; &#9474; &#9474; <span style="color: #cb4b16;">'</span><span style="color: #b58900;">builtin</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f3ecab" class="outline-4">
<h4 id="org5f3ecab">Hierarchy</h4>
<div class="outline-text-4" id="text-org5f3ecab">
<p>
Let&rsquo;s use <a href="https://github.com/veripool/verilog-perl">verilog-perl</a>&rsquo;s <a href="https://metacpan.org/pod/vhier">vhier</a> tool to extract hierarchy if it is available, otherwise use <code>tree-sitter</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span>verilog-ext<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ext-hierarchy-backend</span>
&#9474; &#9474;     <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">executable-find</span> <span style="color: #2aa198;">"vhier"</span><span style="color: #268bd2;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">vhier</span><span style="color: #6c71c4;">)</span>
&#9474; &#9474; &#9474; &#9474; &#9474;     <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">(</span><span style="color: #d33682; font-weight: bold;">treesit-available-p</span><span style="color: #268bd2;">)</span> <span style="color: #cb4b16;">'</span><span style="color: #b58900;">tree-sitter</span><span style="color: #6c71c4;">)</span>
&#9474; &#9474; &#9474; &#9474; &#9474;     <span style="color: #6c71c4;">(</span>t <span style="color: #cb4b16;">'</span><span style="color: #b58900;">builtin</span><span style="color: #6c71c4;">)</span><span style="color: #859900;">)</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org435bc64" class="outline-4">
<h4 id="org435bc64">Templates</h4>
<div class="outline-text-4" id="text-org435bc64">
<p>
Set some sane defaults for templating.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">after!</span> <span style="color: #d33682;">(</span>verilog-ext<span style="color: #d33682;">)</span>
&#9474; <span style="color: #d33682;">(</span><span style="color: #859900; font-weight: bold;">setq</span> <span style="color: #6c71c4;">verilog-ext-template-clock</span>              <span style="color: #2aa198;">"clk"</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-ext-template-reset</span>            <span style="color: #2aa198;">"rst_n"</span>
&#9474; &#9474;     <span style="color: #6c71c4;">verilog-ext-template-reset-active-low</span>      <span style="color: #cb4b16;">'</span><span style="color: #b58900;">t</span><span style="color: #d33682;">)</span><span style="color: #268bd2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org57673c0" class="outline-4">
<h4 id="org57673c0">Linting</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ben Melton</p>
<p class="date">Created: 2024-10-20 Sun 22:20</p>
</div>
</body>
</html>
